In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "names": ["Kausthubh", "Pragnay", "Nageshwara", "Renuka"],
    "age": [18, 16, 51, 46],
    "city": ['Hyderabad', 'Bangalore', 'Jaipur', 'Bombay']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

        names  age       city
0   Kausthubh   18  Hyderabad
1     Pragnay   16  Bangalore
2  Nageshwara   51     Jaipur
3      Renuka   46     Bombay

In [7]:
df.to_csv('Names.csv', index=False)

In [12]:
print(df.head(2))
print('\n')
print(df.tail(2))

       names  age       city
0  Kausthubh   18  Hyderabad
1    Pragnay   16  Bangalore


        names  age    city
2  Nageshwara   51  Jaipur
3      Renuka   46  Bombay

In [13]:
df.describe() #Gives us the statistical Analysis of the data.

             age
count   4.000000
mean   32.750000
std    18.318934
min    16.000000
25%    17.500000
50%    32.000000
75%    47.250000
max    51.000000

In [14]:
df2= pd.read_csv('Names.csv')

In [15]:
df2

        names  age       city
0   Kausthubh   18  Hyderabad
1     Pragnay   16  Bangalore
2  Nageshwara   51     Jaipur
3      Renuka   46     Bombay

In [21]:
# When we want to alter/ access a value/ column
print(df['names'])
print('\n')
print(df['age'][2])

0     Kausthubh
1       Pragnay
2    Nageshwara
3        Renuka
Name: names, dtype: object


51

In [22]:
df2['age'][1] = 15  #This changes the value but is not the correct way

C:\Users\kaust\AppData\Local\Temp\ipykernel_9260\3266992495.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['age'][1] = 15

In [23]:
df2.index = ['first', 'second', 'third', 'fourth']

In [24]:
df2

             names  age       city
first    Kausthubh   18  Hyderabad
second     Pragnay   15  Bangalore
third   Nageshwara   51     Jaipur
fourth      Renuka   46     Bombay

In [ ]:
#Data corresponding to the a column is Called a series. This series is a one dimensional array.